// /////////////////////////////////////////////////////////////////////////////
// HOC - (Բարձրագույն կարգի կոմպոնենտ) տրամաբանությունը բազմակի օգտագործելու
// առաջադեմ ձևերից մեկն է: HOC-ը React API-ի մաս չեն կազմում, բայց դրանք
// հաճախ օգտագործվում են React կոմպոնենտրի համար:

// - Պարզ ասած, գործառույթ է, ֆունկցիա է
// որը ստանաում է կոմպոնենտ և վերադարձնում է նոր կոմպոնենտ:

// Եթե սովորական կոմպոնենտը props-ը վերածում է UI-ի,
//  ապա HOC վերածում է այլ կոմպոնենտի:
// //////////////////////////////////////////////////////////////////////////////
import { Component } from 'react';
import ClickButton from './ClickButton';
import Copy from './copy';

class App extends Component {
  render() {
    return (
      <div className='App'>
        <ClickButton />
        <Copy />
      </div>
    );
  }
}

export default App;
